#include <stdio.h>

//BAEKJOON 15988, 1,2,3 더하기3, LDH

long long d[1000001];	//숫자 N을 1,2,3의 합으로 나타내는 방법의 수

int solve();

int main()
{
    int t = 0;	//테스트케이스 개수
    scanf("%d", &t);
	
    solve();
    
	while(t--)
	{
        int n = 0;	//1,2,3 합으로 나타내는 수
		
        scanf("%d", &n);
        printf("%lld\n", d[n]);
    }
	
    return 0;
}

int solve()
{
    d[1] = 1;	//d[1] = 1
	d[2] = 2;	//d[2] = 1+1, 2
	d[3] = 4;	//d[3] = 1+1+1, 1+2, 2+1, 3
	d[4] = 7;	//d[4] = 1+1+1+1, 1+1+2, 1+2+1, 2+1+1, 2+2, 1+3, 3+1
	d[5] = 13;	//d[5] = 1+1+1+1+1, 1+1+1+2, 1+1+2+1, 1+2+1+1, 2+1+1+1
				//1+2+2, 2+1+2, 2+2+1, 1+1+3, 1+3+1, 3+1+1, 2+3, 3+2
	
    for(int i=6; i<1000001; i++)
	{
        d[i] = d[i-1] + d[i-2] + d[i-3];	//점화식
        d[i] %= 1000000009;
    }
	
	return 0;
}